; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	spectrograph4 - mode
	image2 - mode
	thermograph0 - mode
	infrared3 - mode
	image1 - mode
	GroundStation3 - direction
	Star1 - direction
	Star8 - direction
	Star4 - direction
	Star5 - direction
	Star9 - direction
	Star2 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation0 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph4)
	(supports instrument0 image2)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument1 spectrograph4)
	(supports instrument1 image2)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet16)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 GroundStation7)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet16)
	(supports instrument4 infrared3)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star9)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation6)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon13)
	(supports instrument5 thermograph0)
	(supports instrument5 spectrograph4)
	(supports instrument5 image2)
	(calibration_target instrument5 Star9)
	(supports instrument6 image1)
	(supports instrument6 spectrograph4)
	(calibration_target instrument6 GroundStation6)
	(calibration_target instrument6 GroundStation7)
	(calibration_target instrument6 Star2)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation0)
	(calibration_target instrument7 GroundStation7)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star9)
)
(:goal (and
	(pointing satellite2 Star4)
	(pointing satellite3 GroundStation7)
	(have_image Phenomenon10 spectrograph4)
	(have_image Star11 spectrograph4)
	(have_image Star12 spectrograph4)
	(have_image Phenomenon13 spectrograph4)
	(have_image Phenomenon14 image2)
	(have_image Star15 image1)
	(have_image Planet16 image2)
))

)

; plan
1. (switch_on instrument5 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument5)
   goals met: 0 of 9
2. (calibrate satellite4 instrument5 star9)
   added: (calibrated instrument5)
   goals met: 0 of 9
3. (turn_to satellite4 phenomenon13 star9)
   deleted: (pointing satellite4 star9)
   added: (pointing satellite4 phenomenon13)
   goals met: 0 of 9
4. (take_image satellite4 phenomenon13 instrument5 spectrograph4)
   added: (have_image phenomenon13 spectrograph4)
   goals met: 1 of 9
5. (turn_to satellite4 phenomenon10 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 phenomenon10)
   goals met: 1 of 9
6. (turn_to satellite3 groundstation7 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 groundstation7)
   goals met: 2 of 9
7. (turn_to satellite2 groundstation7 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 groundstation7)
   goals met: 2 of 9
8. (take_image satellite4 phenomenon10 instrument5 spectrograph4)
   added: (have_image phenomenon10 spectrograph4)
   goals met: 3 of 9
9. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 3 of 9
10. (calibrate satellite2 instrument2 groundstation7)
   added: (calibrated instrument2)
   goals met: 3 of 9
11. (turn_to satellite2 star15 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 star15)
   goals met: 3 of 9
12. (take_image satellite2 star15 instrument2 image1)
   added: (have_image star15 image1)
   goals met: 4 of 9
13. (turn_to satellite2 star4 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 star4)
   goals met: 5 of 9
14. (turn_to satellite4 phenomenon14 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 phenomenon14)
   goals met: 5 of 9
15. (take_image satellite4 phenomenon14 instrument5 image2)
   added: (have_image phenomenon14 image2)
   goals met: 6 of 9
16. (turn_to satellite4 planet16 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 planet16)
   goals met: 6 of 9
17. (take_image satellite4 planet16 instrument5 image2)
   added: (have_image planet16 image2)
   goals met: 7 of 9
18. (turn_to satellite4 star11 planet16)
   deleted: (pointing satellite4 planet16)
   added: (pointing satellite4 star11)
   goals met: 7 of 9
19. (take_image satellite4 star11 instrument5 spectrograph4)
   added: (have_image star11 spectrograph4)
   goals met: 8 of 9
20. (turn_to satellite4 star12 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 star12)
   goals met: 8 of 9
21. (take_image satellite4 star12 instrument5 spectrograph4)
   added: (have_image star12 spectrograph4)
   goals met: 9 of 9
